:PROPERTIES:
:ID:       e2ef0f23-72bf-4b7d-b26c-de0f96fb1b28
:END:
#+title: js-oop-getOwnPropertyNames()
#+date: [2024-08-05 一]
#+last_modified:  


#+BEGIN_SRC js :noweb yes :results output
function Person() {}

Person.prototype.name = 'Niclas'
Object.defineProperty(Person.prototype, 'age', {
  value: 18,
  enumerable: false
})

let enumProps = Object.getOwnPropertyNames(Person.prototype)
console.log(enumProps)
console.log(Person.prototype.age)

let p = new Person()
p.address = 'Ania'


enumProps = Object.getOwnPropertyNames(p)
console.log(enumProps)
console.log(p.name)
#+END_SRC

#+RESULTS:
: [ 'constructor', 'name', 'age' ]
: 18
: [ 'address' ]
: Niclas



* See Also
- [[id:adef95fd-8937-4502-9b22-54e4978f0fb5][js-oop-keys()]]
- [[id:30fc8fff-944e-445f-ab34-56e4eb00b60b][js-oop-getOwnPropertySymbols()]]
